using Microsoft.EntityFrameworkCore.Migrations;

#nullable disable

namespace DCMS.Infrastructure.Migrations
{
    /// <inheritdoc />
    public partial class SeedEngineers : Migration
    {
        /// <inheritdoc />
        protected override void Up(MigrationBuilder migrationBuilder)
        {
            // Seed all engineers
            var engineers = new[]
            {
                "م/ عزة الدسوقي", "م/ ندي القصير", "م/ انجي محمد", "م/ احمد كرم", "م/ هدير عمرو",
                "م/ احمد العصار", "م/ حسن مصطفي", "م/ هبة ابو العلا", "م/ سيد الوزير", "د/ محمد انسي الشوتي",
                "م/ دينا عادل فتحي", "م/ حسن ابراهيم", "م/ محمد علوي", "م/ايمان المصري", "م/ سمير سعدالله",
                "م/احمد صبحي", "م/ علياء عبد العظيم", "م/ غادة صلاح", "م/شريف عبد الهادي", "م/ هبة عبد العال",
                "م/ سلوي سامي", "م/ مني كرارة", "م/ محمد سعد رفاعي", "م/احمد الديب", "م/ سامح علي",
                "م/احمد عاطف", "م/ امجد علي", "م/سامح اللقاني", "م/ اماني خضير", "م/ سعيد محمود",
                "م/ حمدي هاشم", "م/ حمدي حسن", "م/احمد مصطفى", "م/ محمد شعبان", "م/ محمد السيد",
                "م/ احمد عزت", "م/ مني عثمان", "م/ عبد الرحمن سليمان", "م/محمود عبد الفتاح", "م/ عبد الحق الصاوي",
                "م/ محمد سلامة", "م/ هادي محمد", "م/ بسام صفوان", "م/ مصطفي عبد المجيد", "م/ حسام فايد",
                "م/ طارق صفوت", "م /محمد العيروسي", "م/ هاني ماهر", "م/ هاني خليل", "م/ نهي اشرف",
                "م /شريف حمدي", "م/ خالد عويس", "م/ خالد عيسي", "م/ احمد عيسي", "م/ اسامة الدسوقي",
                "م/ محمد قاسم", "م/ شريف محسن", "م/ مرام عشماوي", "م/ عوني توفيق", "م/رمزي مصطفي",
                "م/ طارق صلاح", "م/ ياسر زكريا", "م/ علي حمدي", "ا/ ايهاب ميرة", "ا/عبد العاطي عبيد",
                "ا/ علاء شوقي", "ا / موسي علي موسي", "ا/ اشرف عطوة", "ا/ محمد يحيي", "ا/ محمد جمال",
                "ا/ ابراهيم عطا", "م/ ابراهيم عباس", "م/ محمود مرسي", "م/ احمد بركات", "م/ محمد حسن رفعت",
                "ا/ محمد غنيم", "ا/ عماد عبيد", "ا/ حسام عيد", "م/ اسامة شوقت", "م/ احمد منصور",
                "د / عبد الفتاح المصري", "م/ ندا عاطف", "م/ محمد شاكر", "م/ طارق مكي", "م/ ايمن عبدو",
                "م/ يوسف حسين", "م/ محمد ابو دشيش"
            };

            foreach (var engineer in engineers)
            {
                migrationBuilder.InsertData(
                    schema: "dcms",
                    table: "engineers",
                    columns: new[] { "full_name", "is_active", "created_at" },
                    values: new object[] { engineer, true, DateTime.UtcNow });
            }
        }

        /// <inheritdoc />
        protected override void Down(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.Sql("DELETE FROM dcms.engineers WHERE is_active = true");
        }
    }
}
